{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "RobertaProcessing",
    "sep": [
      "</s>",
      2
    ],
    "cls": [
      "<s>",
      0
    ],
    "trim_offsets": true,
    "add_prefix_space": true
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "add": 5,
      "mov": 6,
      "push": 7,
      "inc": 8,
      "and": 9,
      "pop": 10,
      "or": 11,
      "dec": 12,
      "cmp": 13,
      "adc": 14,
      "test": 15,
      "call": 16,
      "xor": 17,
      "sub": 18,
      "lea": 19,
      "sbb": 20,
      "xchg": 21,
      "int3": 22,
      "jmp": 23,
      "je": 24,
      "in": 25,
      "jne": 26,
      "ret": 27,
      "nop": 28,
      "out": 29,
      "ror": 30,
      "cld": 31,
      "clc": 32,
      "imul": 33,
      "rol": 34,
      "jb": 35,
      "sal": 36,
      "loopne": 37,
      "retf": 38,
      "enter": 39,
      "jae": 40,
      "std": 41,
      "jo": 42,
      "outsd": 43,
      "leave": 44,
      "insb": 45,
      "jge": 46,
      "les": 47,
      "js": 48,
      "jl": 49,
      "outsb": 50,
      "stc": 51,
      "hlt": 52,
      "shr": 53,
      "popal": 54,
      "sti": 55,
      "sar": 56,
      "jbe": 57,
      "cli": 58,
      "movzx": 59,
      "ja": 60,
      "jle": 61,
      "int1": 62,
      "jg": 63,
      "shl": 64,
      "jns": 65,
      "arpl": 66,
      "loope": 67,
      "insd": 68,
      "loop": 69,
      "pushal": 70,
      "iretd": 71,
      "jnp": 72,
      "cwde": 73,
      "salc": 74,
      "int": 75,
      "xlatb": 76,
      "lodsb": 77,
      "into": 78,
      "aam": 79,
      "movsd": 80,
      "movsb": 81,
      "daa": 82,
      "cmc": 83,
      "jno": 84,
      "pushfd": 85,
      "aas": 86,
      "rcl": 87,
      "jp": 88,
      "das": 89,
      "aaa": 90,
      "scasd": 91,
      "rcr": 92,
      "lahf": 93,
      "cdq": 94,
      "stosb": 95,
      "stosd": 96,
      "popfd": 97,
      "sahf": 98,
      "jecxz": 99,
      "ljmp": 100,
      "wait": 101,
      "bound": 102,
      "cmpsd": 103,
      "lodsd": 104,
      "scasb": 105,
      "cmpsb": 106,
      "aad": 107,
      "lcall": 108,
      "lds": 109,
      "fmul": 110,
      "idiv": 111,
      "fadd": 112,
      "div": 113,
      "movabs": 114,
      "fld": 115,
      "fisttp": 116,
      "fstp": 117,
      "movups": 118,
      "fild": 119,
      "lock": 120,
      "fdiv": 121,
      "fdivr": 122,
      "movaps": 123,
      "neg": 124,
      "movq": 125,
      "fsubr": 126,
      "fiadd": 127,
      "fimul": 128,
      "not": 129,
      "fcomp": 130,
      "fcom": 131,
      "fsub": 132,
      "mul": 133,
      "fistp": 134,
      "movsx": 135,
      "movdqa": 136,
      "fst": 137,
      "fist": 138,
      "fidiv": 139,
      "sldt": 140,
      "bnd": 141,
      "fidivr": 142,
      "movsxd": 143,
      "ficomp": 144,
      "jrcxz": 145,
      "ficom": 146,
      "fisub": 147,
      "fisubr": 148,
      "ud2": 149,
      "sete": 150,
      "cmove": 151,
      "rep": 152,
      "setne": 153,
      "pushfq": 154,
      "fbstp": 155,
      "fnstsw": 156,
      "cmovne": 157,
      "fnstenv": 158,
      "setg": 159,
      "popfq": 160,
      "movd": 161,
      "fnstcw": 162,
      "fldcw": 163,
      "fdivp": 164,
      "fnsave": 165,
      "movdqu": 166,
      "fbld": 167,
      "fldenv": 168,
      "frstor": 169,
      "cmovb": 170,
      "fld1": 171,
      "xadd": 172,
      "cmovs": 173,
      "fucomi": 174,
      "cmovae": 175,
      "fxch": 176,
      "pxor": 177,
      "mulps": 178,
      "repne": 179,
      "xorps": 180,
      "fcmovnu": 181,
      "cmova": 182,
      "bt": 183,
      "fcos": 184,
      "bswap": 185,
      "fsubp": 186,
      "faddp": 187,
      "ud0": 188,
      "addps": 189,
      "vmovdqa": 190,
      "fucompi": 191,
      "cmovbe": 192,
      "movss": 193,
      "fcomi": 194,
      "fstpnce": 195,
      "fcmovnb": 196,
      "fcompi": 197,
      "fcmovu": 198,
      "ffreep": 199,
      "fmulp": 200,
      "fcmovb": 201,
      "fucomp": 202,
      "fdivrp": 203,
      "psllq": 204,
      "repe": 205,
      "cmpxchg": 206,
      "mulsd": 207,
      "fcmovnbe": 208,
      "pshufw": 209,
      "ffree": 210,
      "fsubrp": 211,
      "fcmovbe": 212,
      "fcmovne": 213,
      "seta": 214,
      "fcmove": 215,
      "setb": 216,
      "movapd": 217,
      "pand": 218,
      "pcmpeqb": 219,
      "subps": 220,
      "por": 221,
      "fucom": 222,
      "addsd": 223,
      "notrack": 224,
      "outsw": 225,
      "fldz": 226,
      "paddd": 227,
      "movlps": 228,
      "cvtpi2ps": 229,
      "psubsb": 230,
      "bsf": 231,
      "vmovaps": 232,
      "cmovl": 233,
      "popaw": 234,
      "fnclex": 235,
      "cdqe": 236,
      "shrd": 237,
      "cmovns": 238,
      "psrlq": 239,
      "comiss": 240,
      "pshufd": 241,
      "sgdt": 242,
      "bsr": 243,
      "lsl": 244,
      "pcmpgtd": 245,
      "cmovg": 246,
      "rdpmc": 247,
      "bts": 248,
      "orps": 249,
      "lar": 250,
      "cvttps2pi": 251,
      "palignr": 252,
      "ucomiss": 253,
      "cmovno": 254,
      "pmovmskb": 255,
      "cmovle": 256,
      "shld": 257,
      "movlpd": 258,
      "str": 259,
      "punpckhdq": 260,
      "subsd": 261,
      "seto": 262,
      "divps": 263,
      "mulss": 264,
      "pcmpeqw": 265,
      "fsin": 266,
      "andps": 267,
      "stosw": 268,
      "repz": 269,
      "fldpi": 270,
      "cmovge": 271,
      "fchs": 272,
      "setae": 273,
      "punpckhbw": 274,
      "setbe": 275,
      "punpcklbw": 276,
      "prefetcht0": 277,
      "cvtsi2sd": 278,
      "setl": 279,
      "comisd": 280,
      "btr": 281,
      "cmovo": 282,
      "cpuid": 283,
      "pextrw": 284,
      "sysret": 285,
      "punpckldq": 286,
      "pcmpeqd": 287,
      "paddw": 288,
      "addss": 289,
      "fucompp": 290,
      "cvtps2pd": 291,
      "setge": 292,
      "femms": 293,
      "fscale": 294,
      "psadbw": 295,
      "ucomisd": 296,
      "punpcklwd": 297,
      "cmovp": 298,
      "rdtsc": 299,
      "unpcklps": 300,
      "frndint": 301,
      "orpd": 302,
      "invd": 303,
      "shufps": 304,
      "psubusw": 305,
      "setle": 306,
      "syscall": 307,
      "pavgb": 308,
      "xorpd": 309,
      "pandn": 310,
      "sqrtps": 311,
      "movhps": 312,
      "clts": 313,
      "paddb": 314,
      "emms": 315,
      "btc": 316,
      "psubd": 317,
      "fcompp": 318,
      "verw": 319,
      "rcpps": 320,
      "pinsrw": 321,
      "psrld": 322,
      "fabs": 323,
      "cvttsd2si": 324,
      "paddq": 325,
      "divsd": 326,
      "psubsw": 327,
      "pmuludq": 328,
      "movmskps": 329,
      "movsw": 330,
      "fldl2t": 331,
      "psubq": 332,
      "psrad": 333,
      "punpcklqdq": 334,
      "pslld": 335,
      "mulpd": 336,
      "cmpps": 337,
      "sets": 338,
      "tzcnt": 339,
      "setns": 340,
      "paddsb": 341,
      "unpckhps": 342,
      "fxam": 343,
      "wbinvd": 344,
      "psubw": 345,
      "pmulhuw": 346,
      "paddusw": 347,
      "vmovdqu": 348,
      "cvtdq2ps": 349,
      "iret": 350,
      "packuswb": 351,
      "pcmpgtb": 352,
      "pmaddwd": 353,
      "lfence": 354,
      "maxps": 355,
      "fdecstp": 356,
      "vpxor": 357,
      "cmovnp": 358,
      "andpd": 359,
      "rsqrtps": 360,
      "paddsw": 361,
      "xbegin": 362,
      "psubb": 363,
      "cwd": 364,
      "ud1": 365,
      "fptan": 366,
      "punpckhwd": 367,
      "setno": 368,
      "pshuflw": 369,
      "psraw": 370,
      "pmullw": 371,
      "f2xm1": 372,
      "fsqrt": 373,
      "cbw": 374,
      "movnti": 375,
      "psrlw": 376,
      "movntps": 377,
      "packsswb": 378,
      "fninit": 379,
      "setnp": 380,
      "insw": 381,
      "sysenter": 382,
      "packssdw": 383,
      "cvtps2pi": 384,
      "vmread": 385,
      "subss": 386,
      "xacquire": 387,
      "fincstp": 388,
      "pause": 389,
      "pushaw": 390,
      "wrmsr": 391,
      "pmaxsw": 392,
      "fyl2x": 393,
      "xrelease": 394,
      "xabort": 395,
      "pcmpgtw": 396,
      "stmxcsr": 397,
      "psubusb": 398,
      "pminub": 399,
      "minps": 400,
      "vmwrite": 401,
      "pmaxub": 402,
      "rdmsr": 403,
      "pavgw": 404,
      "stosq": 405,
      "ftst": 406,
      "psrldq": 407,
      "paddusb": 408,
      "fprem": 409,
      "psllw": 410,
      "fsincos": 411,
      "cmpsw": 412,
      "feni8087_nop": 413,
      "andnps": 414,
      "fpatan": 415,
      "pmulhw": 416,
      "lfs": 417,
      "setp": 418,
      "scasw": 419,
      "getsec": 420,
      "pminsw": 421,
      "fldln2": 422,
      "jcxz": 423,
      "fyl2xp1": 424,
      "sysexit": 425,
      "cvtdq2pd": 426,
      "fldlg2": 427,
      "vpshufd": 428,
      "fprem1": 429,
      "fsetpm": 430,
      "pushf": 431,
      "lss": 432,
      "lldt": 433,
      "fnop": 434,
      "pshufhw": 435,
      "addpd": 436,
      "iretq": 437,
      "rsm": 438,
      "vzeroupper": 439,
      "lodsw": 440,
      "popf": 441,
      "pshufb": 442,
      "fldl2e": 443,
      "fxtract": 444,
      "retfq": 445,
      "fdisi8087_nop": 446,
      "lgs": 447,
      "vmulsd": 448,
      "ldmxcsr": 449,
      "maskmovq": 450,
      "pslldq": 451,
      "cvtsi2ss": 452,
      "movntq": 453,
      "verr": 454,
      "vpaddd": 455,
      "vmovsd": 456,
      "sidt": 457,
      "cmpsq": 458,
      "scasq": 459,
      "cqo": 460,
      "vaddsd": 461,
      "bndstx": 462,
      "cvttss2si": 463,
      "movsq": 464,
      "divss": 465,
      "bndldx": 466,
      "ltr": 467,
      "cvtsd2ss": 468,
      "vpand": 469,
      "vmovntdq": 470,
      "movlhps": 471,
      "vpaddq": 472,
      "smsw": 473,
      "vpsrld": 474,
      "unpcklpd": 475,
      "pcmpistri": 476,
      "lmsw": 477,
      "vpsubsb": 478,
      "prefetchnta": 479,
      "movhlps": 480,
      "rorx": 481,
      "vsubsd": 482,
      "movupd": 483,
      "vfmadd213sd": 484,
      "aesenc": 485,
      "prefetch": 486,
      "vpshufb": 487,
      "vpsrlq": 488,
      "subpd": 489,
      "lgdt": 490,
      "mulx": 491,
      "vpsubsw": 492,
      "vmovups": 493,
      "vmovd": 494,
      "xgetbv": 495,
      "adcx": 496,
      "vpor": 497,
      "vmovq": 498,
      "vpalignr": 499,
      "unpckhpd": 500,
      "vmovapd": 501,
      "prefetchw": 502,
      "vpclmulqdq": 503,
      "vpmuludq": 504,
      "adox": 505,
      "vpslld": 506,
      "vpavgb": 507,
      "vpsubw": 508,
      "cldemote": 509,
      "cvtss2sd": 510,
      "lodsq": 511,
      "vpsubb": 512,
      "aesdec": 513,
      "vpminsw": 514,
      "vcomisd": 515,
      "shrx": 516,
      "shlx": 517,
      "vpsrad": 518,
      "punpckhqdq": 519,
      "vpcmpeqw": 520,
      "vpsllq": 521,
      "vpcmpeqb": 522,
      "cmpeqps": 523,
      "cmpeqsd": 524,
      "prefetcht1": 525,
      "vpcmpgtd": 526,
      "invlpg": 527,
      "vxorps": 528,
      "vaddsubps": 529,
      "vpmullw": 530,
      "cvtpd2ps": 531,
      "lidt": 532,
      "prefetcht2": 533,
      "vaesenc": 534,
      "vpaddb": 535,
      "cmpxchg8b": 536,
      "sqrtss": 537,
      "vpacksswb": 538,
      "vhaddpd": 539,
      "vpaddw": 540,
      "vpaddsw": 541,
      "rsqrtss": 542,
      "vpmovmskb": 543,
      "vorpd": 544,
      "vpsubd": 545,
      "vpsrlw": 546,
      "vhsubpd": 547,
      "vshufpd": 548,
      "vdivsd": 549,
      "vcmpsd": 550,
      "haddps": 551,
      "cmpnleps": 552,
      "vpsubusb": 553,
      "vpsadbw": 554,
      "vpsubq": 555,
      "vpsraw": 556,
      "cmpltps": 557,
      "vorps": 558,
      "vshufps": 559,
      "vcvtdq2pd": 560,
      "vpunpckhqdq": 561,
      "sqrtsd": 562,
      "vfmadd231sd": 563,
      "prefetchwt1": 564,
      "vunpckhps": 565,
      "fxsave": 566,
      "vpmulhw": 567,
      "vperm2i128": 568,
      "vandnps": 569,
      "vpcmpgtb": 570,
      "pfmul": 571,
      "cmpnlepd": 572,
      "pclmulqdq": 573,
      "cvtsd2si": 574,
      "vsubpd": 575,
      "vpsllw": 576,
      "vminps": 577,
      "vunpcklps": 578,
      "vpunpckldq": 579,
      "vcvtsi2ss": 580,
      "aesenclast": 581,
      "vandpd": 582,
      "xsavec": 583,
      "vmptrst": 584,
      "xrstors": 585,
      "vandps": 586,
      "vmulpd": 587,
      "xsaveopt": 588,
      "xsaves": 589,
      "vaddsubpd": 590,
      "vdivps": 591,
      "vsqrtsd": 592,
      "vmulps": 593,
      "vpmaxub": 594,
      "vunpcklpd": 595,
      "vmaxps": 596,
      "fxrstor": 597,
      "vcmppd": 598,
      "vmptrld": 599,
      "vpcmpeqd": 600,
      "andnpd": 601,
      "vpmulhuw": 602,
      "pi2fw": 603,
      "sfence": 604,
      "maxsd": 605,
      "rdseed": 606,
      "clflush": 607,
      "xsave": 608,
      "vpaddusb": 609,
      "vandnpd": 610,
      "vsubps": 611,
      "vpunpckhwd": 612,
      "vcmpss": 613,
      "cmpltpd": 614,
      "minsd": 615,
      "vxorpd": 616,
      "vdivss": 617,
      "vmaxsd": 618,
      "vpmaddwd": 619,
      "xrstor": 620,
      "vpavgw": 621,
      "mfence": 622,
      "vaddpd": 623,
      "vrsqrtss": 624,
      "vcmpps": 625,
      "vunpckhpd": 626,
      "vpsubusw": 627,
      "vpackssdw": 628,
      "vpmaxsw": 629,
      "vpunpckhdq": 630,
      "vpunpcklwd": 631,
      "vpackuswb": 632,
      "vpaddsb": 633,
      "vhaddps": 634,
      "vrcpss": 635,
      "vpcmpgtw": 636,
      "movbe": 637,
      "vaddss": 638,
      "vpandn": 639,
      "vcvtsd2ss": 640,
      "vdivpd": 641,
      "andn": 642,
      "vldmxcsr": 643,
      "vpunpcklqdq": 644,
      "vsqrtss": 645,
      "vpunpckhbw": 646,
      "pavgusb": 647,
      "vaddps": 648,
      "vpblendd": 649,
      "vpminub": 650,
      "sha1msg2": 651,
      "vminsd": 652,
      "vhsubps": 653,
      "phaddsw": 654,
      "vmovss": 655,
      "vpaddusw": 656,
      "aeskeygenassist": 657,
      "vmovlhps": 658,
      "minss": 659,
      "vminpd": 660,
      "vmaxss": 661,
      "vcvtsi2sd": 662,
      "vmaxpd": 663,
      "pinsrb": 664,
      "vpermq": 665,
      "vmulss": 666,
      "aesdeclast": 667,
      "vfmsub213sd": 668,
      "vpunpcklbw": 669,
      "vcvtss2sd": 670,
      "vminss": 671,
      "wrssd": 672,
      "vpsrldq": 673,
      "pfcmpgt": 674,
      "vsubss": 675,
      "pi2fd": 676,
      "vstmxcsr": 677,
      "wrssq": 678,
      "vmovhpd": 679,
      "pfrcpit2": 680,
      "vpslldq": 681,
      "rdrand": 682,
      "vcvtss2si": 683,
      "cvtss2si": 684,
      "vmovlps": 685,
      "vucomiss": 686,
      "vucomisd": 687,
      "vcvttsd2si": 688,
      "vmovlpd": 689,
      "cmpunordps": 690,
      "shufpd": 691,
      "vpcmpgtq": 692,
      "movmskpd": 693,
      "vpbroadcastq": 694,
      "vmovhps": 695,
      "vcvtpd2dq": 696,
      "vfnmadd231sd": 697,
      "vpinsrw": 698,
      "pfcmpge": 699,
      "cmpunordsd": 700,
      "movntdq": 701,
      "sha256rnds2": 702,
      "vaesenclast": 703,
      "cmpleps": 704,
      "cvtpd2dq": 705,
      "pfcmpeq": 706,
      "sha1nexte": 707,
      "cmpnlesd": 708,
      "maxss": 709,
      "movhpd": 710,
      "pfadd": 711,
      "sha1rnds4": 712,
      "vinsertf128": 713,
      "pfrsqrt": 714,
      "vcvtps2pd": 715,
      "cmpnltps": 716,
      "pfnacc": 717,
      "pfsub": 718,
      "pfrcp": 719,
      "vrsqrtps": 720,
      "pfrsqit1": 721,
      "cmpltsd": 722,
      "sha1msg1": 723,
      "vpmacssww": 724,
      "vmovddup": 725,
      "cvttpd2dq": 726,
      "vmcall": 727,
      "cmpneqps": 728,
      "monitor": 729,
      "movdq2q": 730,
      "phsubsw": 731,
      "pmaxuw": 732,
      "psignb": 733,
      "phaddd": 734,
      "mwait": 735,
      "phaddw": 736,
      "pfrcpit1": 737,
      "vprotb": 738,
      "pfacc": 739,
      "pmulhrw": 740,
      "psignd": 741,
      "rcpss": 742,
      "sha256msg2": 743,
      "vpmacssdql": 744,
      "cvtps2dq": 745,
      "pfpnacc": 746,
      "vblendmps": 747,
      "vbroadcasti128": 748,
      "vmovupd": 749,
      "enclv": 750,
      "pf2id": 751,
      "xsetbv": 752,
      "cvttps2dq": 753,
      "pswapd": 754,
      "vmmcall": 755,
      "vmrun": 756,
      "kandnb": 757,
      "pabsw": 758,
      "divpd": 759,
      "pf2iw": 760,
      "pfmin": 761,
      "vinserti128": 762,
      "xstore": 763,
      "pfmax": 764,
      "swapgs": 765,
      "stgi": 766,
      "vmresume": 767,
      "vpperm": 768,
      "cvtpd2pi": 769,
      "kandb": 770,
      "korb": 771,
      "korw": 772,
      "vlddqu": 773,
      "vmovshdup": 774,
      "kmovb": 775,
      "sha256msg1": 776,
      "vmovhlps": 777,
      "vrcpps": 778,
      "sarx": 779,
      "vmlaunch": 780,
      "hsubps": 781,
      "lzcnt": 782,
      "pfsubr": 783,
      "phsubw": 784,
      "vcomiss": 785,
      "vcvttps2dq": 786,
      "kxorb": 787,
      "mwaitx": 788,
      "cmplepd": 789,
      "kunpckwd": 790,
      "sqrtpd": 791,
      "vcvtsd2si": 792,
      "vpcmov": 793,
      "vsqrtps": 794,
      "cmpnltsd": 795,
      "pabsd": 796,
      "vcvttpd2dq": 797,
      "cmpltss": 798,
      "kxnorb": 799,
      "phsubd": 800,
      "pmaddubsw": 801,
      "vpmaxuw": 802,
      "vpshab": 803,
      "vpshuflw": 804,
      "blcmsk": 805,
      "clac": 806,
      "encls": 807,
      "pinsrd": 808,
      "vmxoff": 809,
      "vphaddw": 810,
      "vpminsd": 811,
      "kandw": 812,
      "kmovw": 813,
      "kxorw": 814,
      "pabsb": 815,
      "clzero": 816,
      "enclu": 817,
      "hsubpd": 818,
      "kaddw": 819,
      "vmfunc": 820,
      "vpermi2b": 821,
      "vpinsrd": 822,
      "vzeroall": 823,
      "xcryptcfb": 824,
      "movddup": 825,
      "vcvtps2dq": 826,
      "vcvttss2si": 827,
      "vmovsldup": 828,
      "vpextrd": 829,
      "wrpkru": 830,
      "pcmpestri": 831,
      "pmulhrsw": 832,
      "rdpkru": 833,
      "skinit": 834,
      "stac": 835,
      "vpminud": 836,
      "cmppd": 837,
      "cvttpd2pi": 838,
      "kunpckbw": 839,
      "vcvtdq2ps": 840,
      "vmsave": 841,
      "vpcmpeqq": 842,
      "vpshaw": 843,
      "xtest": 844,
      "cmplesd": 845,
      "rdtscp": 846,
      "xcryptcbc": 847,
      "aesimc": 848,
      "invlpga": 849,
      "kandnw": 850,
      "monitorx": 851,
      "pconfig": 852,
      "vcvtpd2ps": 853,
      "vfmaddps": 854,
      "vphaddd": 855,
      "bndmov": 856,
      "cmpnless": 857,
      "haddpd": 858,
      "kxnorw": 859,
      "minpd": 860,
      "psignw": 861,
      "vfmadd132sd": 862,
      "vfnmadd132sd": 863,
      "vfnmsubps": 864,
      "vphaddsw": 865,
      "vpshad": 866,
      "kaddb": 867,
      "vfmaddsub132pd": 868,
      "vpermd": 869,
      "vpmacsdd": 870,
      "vpshufhw": 871,
      "xcryptofb": 872,
      "xsha1": 873,
      "clgi": 874,
      "extrq": 875,
      "movntsd": 876,
      "sysretq": 877,
      "vextracti128": 878,
      "vfmsubadd231ps": 879,
      "vfnmadd231ss": 880,
      "vpermilpd": 881,
      "vpmaxud": 882,
      "vprotd": 883,
      "vsqrtpd": 884,
      "xend": 885,
      "addsubpd": 886,
      "cmpneqpd": 887,
      "vblendpd": 888,
      "vcmplesd": 889,
      "vcvtqq2pd": 890,
      "vmovntpd": 891,
      "vmovntps": 892,
      "vpshlb": 893,
      "vpshrdvd": 894,
      "xcryptctr": 895,
      "addsubps": 896,
      "cmpordps": 897,
      "cvtpi2pd": 898,
      "insertq": 899,
      "maxpd": 900,
      "pmulld": 901,
      "vbroadcastss": 902,
      "vcmpnltsd": 903,
      "vcvttps2qq": 904,
      "vfmsub231pd": 905,
      "vfmsubsd": 906,
      "vpblendmb": 907,
      "vpmacsdql": 908,
      "vpmacssdd": 909,
      "vpmuldq": 910,
      "vprotw": 911,
      "vroundsd": 912,
      "xsha256": 913,
      "bndcn": 914,
      "endbr64": 915,
      "roundsd": 916,
      "vcmpeqps": 917,
      "vcmptruepd": 918,
      "vfmadd132pd": 919,
      "vfmaddsubpd": 920,
      "vfmaddsubps": 921,
      "vfmsubadd132ps": 922,
      "vfnmadd213sd": 923,
      "vfnmaddps": 924,
      "vfnmsub132ps": 925,
      "vfnmsub231sd": 926,
      "vfnmsubpd": 927,
      "vmaskmovdqu": 928,
      "vmaskmovps": 929,
      "vpcomud": 930,
      "vpmacssdqh": 931,
      "vpmaddubsw": 932,
      "vpmulhrsw": 933,
      "vpshlq": 934,
      "wbnoinvd": 935,
      "bzhi": 936,
      "lddqu": 937,
      "montmul": 938,
      "movshdup": 939,
      "popcnt": 940,
      "vcmpeqsd": 941,
      "vdppd": 942,
      "vfixupimmss": 943,
      "vfmaddsd": 944,
      "vfmaddsub213ps": 945,
      "vfmaddsub231pd": 946,
      "vfnmadd132ss": 947,
      "vfnmaddsd": 948,
      "vfnmsub213ps": 949,
      "vpmacswd": 950,
      "vpmaxsb": 951,
      "vpmaxsd": 952,
      "vpsignd": 953,
      "xcryptecb": 954,
      "blsic": 955,
      "movq2dq": 956,
      "vaesdec": 957,
      "vcvttpd2qq": 958,
      "vdpps": 959,
      "vfmaddsub132ps": 960,
      "vfmsub132pd": 961,
      "vfmsub132ps": 962,
      "vgf2p8affineinvqb": 963,
      "vgf2p8affineqb": 964,
      "vpcomw": 965,
      "vpdpwssd": 966,
      "vpdpwssds": 967,
      "vpermil2ps": 968,
      "vpermilps": 969,
      "vphsubw": 970,
      "vpminsb": 971,
      "vpminuq": 972,
      "vpminuw": 973,
      "vpshlw": 974,
      "blsfill": 975,
      "bndcl": 976,
      "cmpnltss": 977,
      "crc32": 978,
      "pextrq": 979,
      "vcvtuqq2pd": 980,
      "vfmadd132ps": 981,
      "vfmadd231pd": 982,
      "vfmadd231ss": 983,
      "vfmsub231sd": 984,
      "vfnmsub213sd": 985,
      "vfnmsub231ps": 986,
      "vmovmskps": 987,
      "vpermpd": 988,
      "vphsubsw": 989,
      "vpmadcsswd": 990,
      "vpmovzxbd": 991,
      "vprotq": 992,
      "vpsignb": 993,
      "vpsignw": 994,
      "vrangepd": 995,
      "cmpss": 996,
      "kmovd": 997,
      "knotw": 998,
      "kortestw": 999,
      "ktestw": 1000,
      "pextrb": 1001,
      "roundss": 1002,
      "valignq": 1003,
      "vcmptruesd": 1004,
      "vfmadd213ps": 1005,
      "vfmadd213ss": 1006,
      "vfmadd231ps": 1007,
      "vfmsub132sd": 1008,
      "vfmsub132ss": 1009,
      "vfmsubadd213pd": 1010,
      "vfmsubaddpd": 1011,
      "vfnmadd132ps": 1012,
      "vfnmadd213pd": 1013,
      "vfnmadd231pd": 1014,
      "vfnmsub132sd": 1015,
      "vfnmsubsd": 1016,
      "vinsertps": 1017,
      "vmload": 1018,
      "vpandq": 1019,
      "vpblendmw": 1020,
      "vpbroadcastd": 1021,
      "vpcomb": 1022,
      "vpcomub": 1023,
      "vpcomuw": 1024,
      "vpextrw": 1025,
      "vpmacsswd": 1026,
      "vpsrlvd": 1027,
      "vrangeps": 1028,
      "vroundss": 1029,
      "vshuff32x4": 1030,
      "blcfill": 1031,
      "clwb": 1032,
      "movntss": 1033,
      "movsldup": 1034,
      "pext": 1035,
      "t1mskc": 1036,
      "vaesdeclast": 1037,
      "vcmpeqss": 1038,
      "vcmpgeps": 1039,
      "vcmpneq_oqsd": 1040,
      "vcmpngtsd": 1041,
      "vcmptrueps": 1042,
      "vcvtqq2ps": 1043,
      "vfmaddss": 1044,
      "vfmaddsub213pd": 1045,
      "vfmaddsub231ps": 1046,
      "vfmsub231ps": 1047,
      "vfmsubadd213ps": 1048,
      "vfmsubadd231pd": 1049,
      "vfmsubaddps": 1050,
      "vfmsubpd": 1051,
      "vfmsubps": 1052,
      "vfnmadd231ps": 1053,
      "vfnmsub231pd": 1054,
      "vfnmsubss": 1055,
      "vmpsadbw": 1056,
      "vpackusdw": 1057,
      "vpblendw": 1058,
      "vpdpbusd": 1059,
      "vpermi2d": 1060,
      "vpermps": 1061,
      "vpmaskmovd": 1062,
      "vpmaxsq": 1063,
      "vpminsq": 1064,
      "vpmulld": 1065,
      "vpshaq": 1066,
      "vpshld": 1067,
      "vpsllvq": 1068,
      "vpsraq": 1069,
      "vreducess": 1070,
      "vscalefps": 1071,
      "vshufi32x4": 1072,
      "bextr": 1073,
      "blsr": 1074,
      "bndcu": 1075,
      "pextrd": 1076,
      "rdpid": 1077,
      "rstorssp": 1078,
      "valignd": 1079,
      "vcmpeq_osps": 1080,
      "vcmpneq_ossd": 1081,
      "vcmpneq_osss": 1082,
      "vcmpneqpd": 1083,
      "vfmadd132ss": 1084,
      "vfmaddpd": 1085,
      "vfmsub213ps": 1086,
      "vfnmadd132pd": 1087,
      "vfnmadd213ps": 1088,
      "vfnmaddss": 1089,
      "vfnmsub132pd": 1090,
      "vfnmsub213pd": 1091,
      "vfnmsub213ss": 1092,
      "vinsertf32x8": 1093,
      "vpandd": 1094,
      "vpblendmd": 1095,
      "vpblendvb": 1096,
      "vpcmpd": 1097,
      "vpcomq": 1098,
      "vpermi2pd": 1099,
      "vphadduwd": 1100,
      "vpinsrb": 1101,
      "vpmacsww": 1102,
      "vpmadcswd": 1103,
      "vpmaskmovq": 1104,
      "vpmultishiftqb": 1105,
      "vpshldd": 1106,
      "vpshrdvq": 1107,
      "vpsllvd": 1108,
      "vpsravd": 1109,
      "vpternlogq": 1110,
      "vptestnmd": 1111,
      "blci": 1112,
      "blcic": 1113,
      "blsi": 1114,
      "bndmk": 1115,
      "endbr32": 1116,
      "incsspd": 1117,
      "kortestb": 1118,
      "movdiri": 1119,
      "movntpd": 1120,
      "saveprevssp": 1121,
      "setssbsy": 1122,
      "tpause": 1123,
      "vblendps": 1124,
      "vblendvps": 1125,
      "vcmpeq_uqpd": 1126,
      "vcmpeq_uqss": 1127,
      "vcmpeqpd": 1128,
      "vcmpfalse_ospd": 1129,
      "vcmpfalse_osss": 1130,
      "vcmpgepd": 1131,
      "vcmple_oqss": 1132,
      "vcmpltsd": 1133,
      "vcmpnltpd": 1134,
      "vcmpnltss": 1135,
      "vcmpord_sss": 1136,
      "vcvttss2usi": 1137,
      "vfixupimmps": 1138,
      "vfixupimmsd": 1139,
      "vfmadd213pd": 1140,
      "vfmsub213ss": 1141,
      "vfmsub231ss": 1142,
      "vfmsubadd132pd": 1143,
      "vfmsubss": 1144,
      "vfnmaddpd": 1145,
      "vfpclasspd": 1146,
      "vgetmantsd": 1147,
      "vmclear": 1148,
      "vmovmskpd": 1149,
      "vpandnd": 1150,
      "vpandnq": 1151,
      "vpblendmq": 1152,
      "vpcmpb": 1153,
      "vpcmpud": 1154,
      "vpcomd": 1155,
      "vpcomfalseq": 1156,
      "vpermt2d": 1157,
      "vpermt2pd": 1158,
      "vpermw": 1159,
      "vphadduwq": 1160,
      "vpmacsdqh": 1161,
      "vpmadd52luq": 1162,
      "vpmaxuq": 1163,
      "vporq": 1164,
      "vprolvd": 1165,
      "vprorvd": 1166,
      "vprorvq": 1167,
      "vpshldvq": 1168,
      "vpshldvw": 1169,
      "vpshrdq": 1170,
      "vpternlogd": 1171,
      "vptestmd": 1172,
      "vrcp28ss": 1173,
      "vscalefss": 1174,
      "blcs": 1175,
      "blendps": 1176,
      "clrssbsy": 1177,
      "cmpless": 1178,
      "cmpneqsd": 1179,
      "cmpnltpd": 1180,
      "kandd": 1181,
      "kandnq": 1182,
      "ktestb": 1183,
      "kxnord": 1184,
      "lwpval": 1185,
      "maskmovdqu": 1186,
      "pdep": 1187,
      "pminud": 1188,
      "umwait": 1189,
      "v4fmaddps": 1190,
      "vblendmpd": 1191,
      "vcmpeq_ospd": 1192,
      "vcmpeq_uqps": 1193,
      "vcmpeq_ussd": 1194,
      "vcmpfalse_osps": 1195,
      "vcmpfalse_ossd": 1196,
      "vcmpfalsepd": 1197,
      "vcmpfalsesd": 1198,
      "vcmpge_oqsd": 1199,
      "vcmpgesd": 1200,
      "vcmpgt_oqpd": 1201,
      "vcmpgt_oqsd": 1202,
      "vcmpgtpd": 1203,
      "vcmpgtss": 1204,
      "vcmple_oqps": 1205,
      "vcmple_oqsd": 1206,
      "vcmplepd": 1207,
      "vcmpleps": 1208,
      "vcmplt_oqpd": 1209,
      "vcmplt_oqss": 1210,
      "vcmpltps": 1211,
      "vcmpneq_ussd": 1212,
      "vcmpneqps": 1213,
      "vcmpnge_uqpd": 1214,
      "vcmpnge_uqsd": 1215,
      "vcmpngepd": 1216,
      "vcmpngess": 1217,
      "vcmpngt_uqps": 1218,
      "vcmpngtss": 1219,
      "vcmpnle_uqsd": 1220,
      "vcmpnlepd": 1221,
      "vcmpord_spd": 1222,
      "vcmpord_ssd": 1223,
      "vcmpordpd": 1224,
      "vcmpordsd": 1225,
      "vcmptrue_usss": 1226,
      "vcmptruess": 1227,
      "vcmpunord_spd": 1228,
      "vcmpunord_sps": 1229,
      "vcmpunord_ssd": 1230,
      "vcmpunord_sss": 1231,
      "vcmpunordsd": 1232,
      "vcompressps": 1233,
      "vcvttpd2uqq": 1234,
      "vcvttps2uqq": 1235,
      "vcvttsd2usi": 1236,
      "vcvtudq2pd": 1237,
      "vcvtusi2sd": 1238,
      "vdbpsadbw": 1239,
      "vexp2ps": 1240,
      "vfixupimmpd": 1241,
      "vfnmadd213ss": 1242,
      "vfnmsub132ss": 1243,
      "vfnmsub231ss": 1244,
      "vfrczpd": 1245,
      "vgatherdpd": 1246,
      "vgetexppd": 1247,
      "vgetexpss": 1248,
      "vgf2p8mulb": 1249,
      "vinsertf32x4": 1250,
      "vinserti32x4": 1251,
      "vmaskmovpd": 1252,
      "vmovdqu32": 1253,
      "vmxon": 1254,
      "vpabsd": 1255,
      "vpbroadcastw": 1256,
      "vpcmpq": 1257,
      "vpcmpuw": 1258,
      "vpcmpw": 1259,
      "vpcomgew": 1260,
      "vpcomltq": 1261,
      "vpermb": 1262,
      "vpermi2q": 1263,
      "vpermi2w": 1264,
      "vpermil2pd": 1265,
      "vpermt2b": 1266,
      "vpexpandd": 1267,
      "vphaddbq": 1268,
      "vpinsrq": 1269,
      "vpmadd52huq": 1270,
      "vpmovsqb": 1271,
      "vpmovsxbd": 1272,
      "vpmovzxwq": 1273,
      "vpord": 1274,
      "vprolvq": 1275,
      "vpshrdd": 1276,
      "vpshrdw": 1277,
      "vpsravq": 1278,
      "vpsravw": 1279,
      "vptestnmb": 1280,
      "vptestnmq": 1281,
      "vptestnmw": 1282,
      "vpxord": 1283,
      "vrangess": 1284,
      "vrcp14pd": 1285,
      "vrcp14sd": 1286,
      "vrcp14ss": 1287,
      "vrcp28sd": 1288,
      "vreducesd": 1289,
      "vrndscalesd": 1290,
      "vrndscaless": 1291,
      "vrsqrt28pd": 1292
    },
    "unk_token": "<unk>"
  }
}